#  Задание 1 - декоратор без параметра:
#
#  Реализовать декоратор logger, который выводит имя функции, её аргументы и время выполнения. Можно добавить вывод результата.


def fun():
    pass


if __name__ == "__main__":
    print(1)